import type { TNews } from '@/entities/news/types';

export const mockNews: TNews[] = [
  {
    id: '12',
    images: null,
    type: 'Анонс мероприятия',
    date: '2026-04-30T16:00:00+03:00',
    title: '«ЭНКАНТО»: МАГИЯ СЕМЬИ И СКРЫТЫЕ СМЫСЛЫ',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457240014%2Falbum-152977101_00',
    text: `
      <p>Приглашаем к просмотру и психологическому разбору мультфильма «Энканто».</p>
      <p>Эта история не только о магии, ярких домах и необычных дарах. Это история о семье. О том, как формируется род, как каждому в семье отведена своя роль и как часто за любовью скрываются ожидания, тревога, долг и необходимость быть «достаточно хорошим».</p>
      <p>Во время просмотра, вместе с приглашенным экспертом, логотерапевтом Николаем Емельянчуком обсудим:</p>
      <ul>
        <li>роли семьи Мадригаль;</li>
        <li>как передаются родовые сценарии;</li>
        <li>что происходит, когда человек не вписывается в семейные ожидания;</li>
        <li>почему именно тот, кто кажется «не таким», может стать тем, кто внесет изменения в родовую систему.</li>
      </ul>
      <p>Это будет теплая встреча для тех, кому интересны темы семьи, идентичности и бережного взгляда на себя через историю, рассказанную в кино.</p>
      <p>Ждем тебя 30 апреля в 16.00 в Добро центре (Павла Корчагина 22, ауд-201)</p>
      `,
  },
  {
    id: '11',
    images: null,
    type: 'Анонс мероприятия',
    date: '2026-04-10T12:00:00+03:00',
    title: 'Приглашаем на профилактическую встречу «Чистое поколение»',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239997%2Falbum-152977101_00',
    text: `
      <p>Вместе посмотрим документальный фильм о судьбах молодых людей столкнувшихся с наркотиками, обсудим как сохранить себя, не поддаться опасным соблазнам и сделать выбор в пользу жизни, здоровья и безопасного будущего.</p>
      <p>Ждем тебя 10 апреля 2026</p>
      <p>Начало в 12.00</p>
      <p>Локация: Павла Корчагина 22, Добро центр, ауд. 201.</p>
      <p>В конце мероприятия пройдет награждение участников конкурса плакатов и видеороликов, а также открытие выставки с работами конкурсантов.</p>
      `,
  },
  {
    id: '10',
    images: null,
    type: 'Анонс мероприятия',
    date: '2026-04-03T14:17:00+03:00',
    title: '💥 Есть идея, о которой важно сказать? 💥',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239996%2Falbum-152977101_00',
    text: `
      <p>Участвуйте в конкурсе социальных плакатов и видеороликов в рамках конкурса "Чистое поколение - 2026".</p>
      <p>Тема конкурса — ЗОЖ, осознанный выбор, безопасность и жизнь без зависимости .</p>
      <p>К участию приглашаются студенты Московского Политеха и филиалов.</p>
      <p>Можно отправить плакат или видеоролик .</p>
      <p>❗Прием работ до 5 апреля 2026</p>
      <p>Куда отправлять: <a href="mailto:Festival@mospolytech.ru">Festival@mospolytech.ru</a></p>
      <p>Награждение и открытие выставки плакатов: 10 апреля в 12:00, ПК-201</p>
      <p>👉Что важно:</p>
      <ul>
        <li>четкая идея и социальный посыл;</li>
        <li>креативность и оригинальность;</li>
        <li>сильная подача и эмоциональное воздействие.</li>
      </ul>
      <p>При создании видеоролика можно использовать нейросети — главное, указать это при подаче заявки.</p>
      <p>Подробности и положения о конкурсе — по ссылке <a href="https://clck.ru/3Sv5fj">https://clck.ru/3Sv5fj</a>.</p>
      `,
  },
  {
    id: '9',
    images: null,
    type: 'Анонс мероприятия',
    date: '2026-04-02T17:00:00+03:00',
    title: 'Прямой эфир с психологами о том, что волнует каждого',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239991%2Falbum-152977101_00',
    text: `
      <p>Приглашаем на открытый прямой эфир, где психологи обсудят темы, которые особенно остро переживаются в молодом возрасте и часто остаются без открытого разговора:</p>
      <ul>
        <li>чем депрессия отличается от обычной грусти;</li>
        <li>почему сложно начать даже важное дело;</li>
        <li>как повысить самооценку;</li>
        <li>откуда возникает страх «не состояться» в жизни.</li>
      </ul>
      <p>Когда: 2 апреля в 17.00</p>
      <p>Где: <a href="https://telemost.yandex.ru/j/93947432582002">https://telemost.yandex.ru/j/93947432582002</a></p>
      `,
  },
  {
    id: '99',
    images: null,
    type: null,
    date: '2026-04-02T17:00:00+03:00',
    title: 'Тест',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239991%2Falbum-152977101_00',
    text: `
      <p>Тест</p>
      `,
  },
  {
    id: '100',
    images: [
      '/news/1.jpg',
      '/news/2.jpg',
      '/news/3.jpg',
      '/news/4.jpg',
      '/news/5.jpg',
      '/news/6.jpg',
      '/news/7.jpg',
      '/news/8.jpg',
    ],
    type: null,
    date: '2026-04-02T17:00:00+03:00',
    title: 'Тест2',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239991%2Falbum-152977101_00',
    text: `
      <p>Тест2</p>
      `,
  },
  {
    id: '5',
    images: ['/news/5.jpg'],
    type: 'Анонс мероприятия',
    date: '2026-03-13T16:30:00+03:00',
    title:
      'Знакомо ли вам понятие «троллинг»? Приходилось ли становиться его объектом? А может быть автором? Что это за феномен и почему мы так или иначе соприкасаемся с ним в обществе?',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239990%2Falbum-152977101_00',
    text: `
      <p>🆕Если заинтересовались, то приглашаем вас на встречу с психологом-консультантом, логотерапевтом, магистром психологии, преподавателем кафедры «Психологии личности» Московского Института Психоанализа, заместителем академического руководителя магистерской программы «Экзистенциальная психология личности и логотерапия» Николаем Емельянчуком по теме «Троллинг и деструктивная коммуникация, виды, причины и способы противодействия».</p>
      <p>В форме диалога мы разберём неоднозначную тему «троллинга», рассмотрим способы реагирования с целью сделать свою повседневную жизнь более спокойной и устойчивой.</p>
      <p>Ждём вас 13.03.26 (в пятницу) в Московском Политехе на ул. Павла Корчагина, д.22, в аудитории ПК-201 в 16.30.</p>
      <p>Число участников ограничено.</p>
      <p>Ссылка на регистрацию ниже 👇</p>
      <p><a href="https://spp-polytech-event.timepad.ru/event/3865315/">https://spp-polytech-event.timepad.ru/event/3865315/</a></p>
    `,
  },
  {
    id: '6',
    images: ['/news/6.jpg'],
    type: 'Анонс мероприятия',
    date: '2026-03-04T16:00:00+03:00',
    title:
      '💫 Мы решили порадовать наших прекрасных девушек и пригласить на тренинг, который поможет вам найти баланс между внутренней силой и заботой о себе.',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239989%2Falbum-152977101_00',
    text: `
      <p>Что вас ждёт на тренинге?</p>
      <ul>
        <li>💪 Укрепление уверенности в себе. Вы научитесь ценить свою уникальность и возможности, не сомневаясь в своём потенциале.</li>
        <li>🚧 Мягкое отстаивание личных границ. Мы разберём, как легко и с уважением говорить «нет» и отстаивать своё пространство, сохраняя гармонию в отношениях.</li>
        <li>✨ Осознание своих сильных сторон. Вы откроете для себя свои скрытые ресурсы и возможности, которые помогут вам двигаться вперёд с уверенностью.</li>
        <li>🌱 Инструменты самоподдержки в стрессовых ситуациях. Научитесь справляться с трудными моментами и находить опору внутри себя.</li>
      </ul>
      <p>Этот тренинг — это путь к вашему лучшему «я». Присоединяйтесь и откройте новые горизонты для себя!</p>
      <p>📍Место проведения: г. Москва, ул.Павла Корчагина, д. 22, Добро.центр, ауд. ПК-201</p>
      <p>📅Дата: 4 марта 2026 (среда)</p>
      <p>🕒Время: 16.00 – 18.00</p>
      <p>👩🏻Спикер: психолог Абасова Лейла Рауфовна</p>
      <p>🔗 Записаться на тренинг: <a href="https://spp-polytech-event.timepad.ru/event/3843591/">https://spp-polytech-event.timepad.ru/event/3843591/</a></p>
      `,
  },
  {
    id: '7',
    images: ['/news/7.jpg'],
    type: 'Анонс мероприятия',
    date: '2025-12-18T16:00:00+03:00',
    title:
      'Приглашаем на мероприятие: «МАКсимальная настройка на успешную сессию»! ✨',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239966%2Falbum-152977101_00',
    text: `
      <p>Волнуетесь перед сессией? Присоединяйтесь к нам, приходите на встречу организованную в рамках психологического клуба Головоломка, где мы будем работать с МАК-картами. Это увлекательный и простой способ понять свои страхи, выявить скрытые ресурсы и создать индивидуальную стратегию успеха. Давайте вместе превратим стресс в сосредоточенность, а неуверенность — в чёткий план действий!</p>
      <p>Когда: 18 декабря, 16:00</p>
      <p>Где: ПК 201 «Добро.Центр»</p>
      <p>Приглашённый эксперт: Емельянчук Николай Николаевич, психолог-консультант с десятилетним стажем, сертифицированный логотерапевт, преподаватель Московского института психоанализа.</p>
      <p>Ждем всех желающих! Чтобы попасть на мероприятие — зарегистрируйся по ссылке: <a href="https://forms.yandex.ru/u/693feb9302848f0017e">https://forms.yandex.ru/u/693feb9302848f0017e</a></p>
      `,
  },
  {
    id: '2',
    images: ['/news/2.jpg'],
    type: 'Отчет о мероприятии',
    date: '2025-11-24T16:30:00+03:00',
    title: '🎉 ПСИХОparty: незабываемый «День психолога»!',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239950%2Falbum-152977101_00',
    text: `
      <p>24 ноября мы погрузились в особую атмосферу, где рисовали внутренние миры, исследовали себя и просто расслаблялись. Уютную атмосферу праздника добавило чаепитие с вкусняшками и милые подарочки для участников активностей.</p>
      <p>Спасибо всем, кто пришёл.</p>
      <p>И огромная благодарность команде психологов университета за организацию мероприятия! 🫶</p>
      <p>Ждём всех на следующих встречах!</p>
      `,
  },
  {
    id: '1',
    images: ['/news/1.jpg'],
    type: 'Анонс мероприятия',
    date: '2025-11-24T15:00:00+03:00',
    title: 'Мы уже придумали, как тебе весело провести вечер понедельника!',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239948%2Falbum-152977101_00',
    text: `
      <p>24 ноября команда психологов устраивает ПСИХОParty, где будет множетсво активностей на любой вкус, все подробности по мероприятиям ниже 👇🏻</p>
      <p>Время: 15:00</p>
      <p>Место: ул. Павла Корчагина, 22 (Добро.Центр)</p>
      <p>‼ обратите внимание, что регистрация обязательна к каждому интерактиву</p>
      <p>Игра «Доверие в слепую»</p>
      <p>Проверь, можешь ли ты доверять первому встречному пройдя нашу полосу препятствия? Или приводи с собой друга или подругу, если хочешь выяснить уровень вашего доверия и взаимопонимания.</p>
      <p>Доступные временные слоты для участия: 15.00, 16.00 и 17.00.</p>
      <p>Регистрацию должен пройти каждый участник события</p>
      <p><a href="https://spp-polytech-event.timepad.ru/event/3681416/">https://spp-polytech-event.timepad.ru/event/3681416/</a></p>
      <p>Мастер-класс «Голос тела: инструкция по выходу из головы»</p>
      <p>Мы часто живём в голове и теряем связь с телесными сигналами. На встрече ты сможешь поисследовать свои ощущения, переключаться из мыслей в телесный опыт и замечать потребности своего тела. Это практическое пространство, где можно мягко замедлиться, уловить внутренний ритм и восстановить контакт с собой через тело.</p>
      <p>Доступные временные слоты для участия команд: 15.00 и 16.30.</p>
      <p>Регистрацию должен пройти каждый участник события</p>
      <p><a href="https://spp-polytech-event.timepad.ru/event/3681483/">https://spp-polytech-event.timepad.ru/event/3681483/</a></p>
      <p>Арт-терапевтический мастер-класс «Отражение».</p>
      <p>Прислушайтесь... Какое оно, ваше внутреннее состояние прямо сейчас? Позвольте себе выразить его на бумаге – в цвете, в движении, в пятнах.</p>
      <p>Доступные временные слоты для участия команд: 15.00 и 16.30.</p>
      <p>Регистрацию должен пройти каждый участник мастер-класса</p>
      <p><a href="https://spp-polytech-event.timepad.ru/event/3681494/">https://spp-polytech-event.timepad.ru/event/3681494/</a></p>
      <p>Серия игр «Активация»</p>
      <p>Активируй свои когнитивные функции с помощью занимательных упражнений. Выполни их все и получи награду.</p>
      <p>Регистрация на активность не требуется.</p>
      <p>Активность «Сила подсознания»</p>
      <p>Узнай, что говорит твое подсознание. Вытяни карту и узнай свои скрытые эмоции, потребности, желания, страхи или внутренние конфликты.</p>
      <p>Регистрация на активность не требуется.</p>
      <p>Психологический квиз</p>
      <p>Проверь свои психологические знания, прокачай навыки работы в команде и коммуникативные способности на викторине. Победителей ждут призы.</p>
      <p>Доступные временные слоты для участия команд: 15.00, 16.00 и 17.00.</p>
      <p>Обратите внимание, что минимальное количество участников в команде: 3 человека. Регистрацию должен пройти один человек от команды.</p>
      <p><a href="https://spp-polytech-event.timepad.ru/event/3681211/">https://spp-polytech-event.timepad.ru/event/3681211/</a></p>
      <p>🍪 Не забудь взять с собой вкусняшки!</p>
      `,
  },
  {
    id: '8',
    images: ['/news/8.jpg'],
    type: 'Отчет о мероприятии',
    date: '2025-05-17T12:00:00+03:00',
    title: 'Нет ни одной семьи, не пострадавшей от войны',
    // link: 'https://vk.com/@spp_polytech-net-ni-odnoi-semi-ne-postradavshei-ot-voiny',
    text: `
      <p>В этом году мы отмечаем особую дату — 80 лет со дня Великой Победы. Но Победа была не только военной — она была человеческой. Её ковали не только на передовой, но и в тылу: на заводах, в полях, в школах, в бессонных ночах ожидания.</p>
      <p>Семья стала той опорой, которая держала на себе всю страну. Женщины писали письма и работали без выходных. Дети взрослели в одночасье. Старики заменяли отцов. Каждый делал невозможное.</p>
      <p>Солдат шёл на фронт не ради абстрактных идеалов, а ради конкретных близких: матери, жены, ребёнка. Ради мира, где можно просто вернуться домой. Ради того, чтобы дети не знали, что такое война.</p>
      <p>17–18 мая студенты проекта «Семья как совместный проект» отправились в военно-историческую поездку по местам боевой славы Московского народного ополчения. Они прошли маршрутом: Бородино – Вязьма – Богородицкое поле – Хмелита.</p>
      <p>Вяземская земля до сих пор хранит память о подвиге и боли тех, кто защищал Москву. Такие места помогают осознать истинную цену Победы.</p>
      <p>Благодарим Сообщество потомков Московского ополчения и Профком Московского Политеха за возможность прикоснуться к истории и почтить память героев.</p>
      <p>«Если бы не мысль о родных — не выстоял бы» — эти слова солдатских писем напоминают нам: любовь, семья и дом — самое важное, что у нас есть.</p>
      `,
  },
  {
    id: '3',
    images: ['/news/3.jpg'],
    type: 'Анонс мероприятия',
    date: '2025-04-18T17:40:00+03:00',
    title: 'Психологическая мастерская для сотрудников Московского Политеха ✨',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239825%2Falbum-152977101_00',
    text: `
      <p>Усталость, раздражительность, потеря мотивации и даже частые болезни - знакомы ли вам эти состояния? Если так, то приглашаем вас на психологическую мастерскую по профилактике выгорания «Ресурсы и баланс».</p>
      <p>Мастерская будет полезна тем, кто видит у себя потребность в сохранении устойчивости и эмоционального здоровья. Вас ждут интерактивные упражнения и групповое обсуждение.</p>
      <p>Встречаемся 18 апреля на ул. Большая Семеновская, 38 в аудитории Н-405</p>
      <p>Сбор участников: 17:40-18:00</p>
      <p>Мероприятие проведет психолог СПП Московского Политеха Ольга Сафронова.</p>
      <p>Регистрация 👉🏻 <a href="https://clck.ru/3LHqHj">https://clck.ru/3LHqHj</a></p>
      <p>(количество мест ограничено)</p>
      `,
  },
  {
    id: '4',
    images: ['/news/4.jpg'],
    type: 'Анонс мероприятия',
    date: '2024-12-25T14:30:00+03:00',
    title: '«Круглый стол» на тему семейных ценностей',
    // link: 'https://vk.com/spp_polytech?z=photo-152977101_457239727%2Falbum-152977101_00',
    text: `
      <p>«Круглый стол» на тему семейных ценностей</p>
      <p>📅 Дата: 25 декабря</p>
      <p>📍 Место: ул. Прянишникова, 2А, ауд. 1211</p>
      <p>🕒 Время: 14:30 – 16:00</p>
      <p>Приглашаем вас на «Круглый стол», посвященный семейным ценностям и традициям, совместимости, социальной поддержке и новым тенденциям! В программе:</p>
      <ul>
      <li>Выступления экспертов и многодетных родителей.</li>
      <li>Обсуждение современных вопросов семьи.</li>
      <li>Музыкальный номер и телемост с семьей из Душанбе.</li>
      </ul>
      <p>Не упустите возможность обменяться опытом и узнать новое!</p>
      <p>Ссылка на онлайн трансляцию: <a href="https://my.mts-link.ru/j/19394445/1232171321">https://my.mts-link.ru/j/19394445/1232171321</a></p>
      `,
  },
];
